In [23]:
import numpy as np
import pandas as pd

In [24]:
from numpy.random import randn

In [25]:
np.random.seed(101)

In [26]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [27]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
# checking the boolean values

In [29]:
booldf = df > 0

In [30]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [31]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [33]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [35]:
resultdf = df[df['Z']<0]

In [36]:
resultdf

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [98]:
df[df['W']>0][['Y','X']]

               Y         X
States
MH      0.907969  0.628133
GJ     -0.848077 -0.319318
PJ     -0.933237 -0.758872
HP      2.605967  1.978757

In [99]:
boolser = df['W']>0

In [100]:
boolser

States
MH     True
GJ     True
RJ    False
PJ     True
HP     True
Name: W, dtype: bool

In [101]:
result = df[boolser]

In [102]:
result

               W         X         Y         Z states
States
MH      2.706850  0.628133  0.907969  0.503826     GJ
GJ      0.651118 -0.319318 -0.848077  0.605965     MH
PJ      0.188695 -0.758872 -0.933237  0.955057     KL
HP      0.190794  1.978757  2.605967  0.683509     RJ

In [42]:
mycols = ['Y','X']

In [44]:
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [52]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [53]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [54]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [75]:
newindia = 'GJ MH HP KL RJ'.split()

In [76]:
newindia

['GJ', 'MH', 'HP', 'KL', 'RJ']

In [77]:
df['states'] = newindia

In [78]:
df

          W         X         Y         Z states
A  2.706850  0.628133  0.907969  0.503826     GJ
B  0.651118 -0.319318 -0.848077  0.605965     MH
C -2.018168  0.740122  0.528813 -0.589001     HP
D  0.188695 -0.758872 -0.933237  0.955057     KL
E  0.190794  1.978757  2.605967  0.683509     RJ

In [85]:
df.set_index('States')

               W         X         Y         Z states
States
MH      2.706850  0.628133  0.907969  0.503826     GJ
GJ      0.651118 -0.319318 -0.848077  0.605965     MH
RJ     -2.018168  0.740122  0.528813 -0.589001     HP
PJ      0.188695 -0.758872 -0.933237  0.955057     KL
HP      0.190794  1.978757  2.605967  0.683509     RJ

In [86]:
df

          W         X         Y         Z states States
A  2.706850  0.628133  0.907969  0.503826     GJ     MH
B  0.651118 -0.319318 -0.848077  0.605965     MH     GJ
C -2.018168  0.740122  0.528813 -0.589001     HP     RJ
D  0.188695 -0.758872 -0.933237  0.955057     KL     PJ
E  0.190794  1.978757  2.605967  0.683509     RJ     HP

In [94]:
df.set_index('States',inplace = True)

KeyError: "None of ['States'] are in the columns"

In [95]:
df

               W         X         Y         Z states
States
MH      2.706850  0.628133  0.907969  0.503826     GJ
GJ      0.651118 -0.319318 -0.848077  0.605965     MH
RJ     -2.018168  0.740122  0.528813 -0.589001     HP
PJ      0.188695 -0.758872 -0.933237  0.955057     KL
HP      0.190794  1.978757  2.605967  0.683509     RJ